app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs"  ORDER BY "songs"."created_at" DESC LIMIT 20 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "songs" LIMIT 20 OFFSET 1000) subquery_for_count
---
  def index
    @songs = Song.order(:created_at).page params[:page]